//Self 01. Задание 1
//Напишите программу на основе проекта консольного приложения. Вычислите и выведите на экран площадь правильного 𝑛-угольника с длиной стороны 𝑙 //(1≤𝑛<11, 𝑙>0). Для вычислений используйте формулу:

//𝑆=  (𝑛𝑙^2)/(4 𝑡𝑔(𝜋/𝑛))
//До решения задачи подумайте, какие переменные и каких типов планируется использовать? Какие алгоритмические конструкции (и для чего) потребуются?
namespace dz3
{
    internal class Program
    {
        static void Main(string[] args)
        {
            int n = int.Parse(Console.ReadLine());
            double l = double.Parse(Console.ReadLine()), s;
            if (n >= 1 && n < 11 && l > 0)
            {
                s = (n * l * l) / (4 * Math.Tan(Math.PI / n));
                Console.WriteLine($"Площадь равна {s:F2}");
            }
            else
            {
                Console.WriteLine("Входные данные неверны");
            }
        }
    }
}
